eringerli/esp32-aog/src/main.cpp
        switch ( initialisation.outputType ) {
          case SteerConfig::OutputType::SteeringMotorIBT2: {
            ledcWriteTone( 0, steerConfig.pwmFrequency );
            ledcWriteTone( 1, steerConfig.pwmFrequency );
          }
          break;

          default:
            break;
        }
      } );
      ESPUI.addControl( ControlType::Min, "Min", String( "1000" ), ControlColor::Peterriver, num );
      ESPUI.addControl( ControlType::Max, "Max", String( "5000" ), ControlColor::Peterriver, num );
      ESPUI.addControl( ControlType::Step, "Step", String( "100" ), ControlColor::Peterriver, num );
    }
  }

  // Steering PID Tab
  {
    uint16_t tab  = ESPUI.addControl( ControlType::Tab, "Steering PID", "Steering PID" );

    ESPUI.addControl( ControlType::Switcher, "Allow AgOpenGPS to overwrite PID values", String( steerConfig.allowPidOverwrite ? "1" : "0" ), ControlColor::Peterriver, tab,
    []( Control * control, int id ) {
      steerConfig.allowPidOverwrite = control->value.toInt() == 1;
    } );

    {
      uint16_t num = ESPUI.addControl( ControlType::Number, "PID Kp", String( steerConfig.steeringPidKp ), ControlColor::Peterriver, tab,
      []( Control * control, int id ) {
        steerConfig.steeringPidKp = control->value.toDouble();
      } );
      ESPUI.addControl( ControlType::Min, "Min", String( "0" ), ControlColor::Peterriver, num );
      ESPUI.addControl( ControlType::Max, "Max", String( "50" ), ControlColor::Peterriver, num );
      ESPUI.addControl( ControlType::Step, "Step", String( ".01" ), ControlColor::Peterriver, num );
    }
    {
      uint16_t num = ESPUI.addControl( ControlType::Number, "PID Ki", String( steerConfig.steeringPidKi ), ControlColor::Peterriver, tab,
      []( Control * control, int id ) {
        steerConfig.steeringPidKi = control->value.toDouble();
      } );
      ESPUI.addControl( ControlType::Min, "Min", String( "0" ), ControlColor::Peterriver, num );
      ESPUI.addControl( ControlType::Max, "Max", String( "50" ), ControlColor::Peterriver, num );
      ESPUI.addControl( ControlType::Step, "Step", String( ".0001" ), ControlColor::Peterriver, num );
    }
    {
      uint16_t num = ESPUI.addControl( ControlType::Number, "PID Kd", String( steerConfig.steeringPidKd ), ControlColor::Peterriver, tab,
      []( Control * control, int id ) {
        steerConfig.steeringPidKd = control->value.toDouble();
      } );
      ESPUI.addControl( ControlType::Min, "Min", String( "0" ), ControlColor::Peterriver, num );
      ESPUI.addControl( ControlType::Max, "Max", String( "50" ), ControlColor::Peterriver, num );
      ESPUI.addControl( ControlType::Step, "Step", String( ".0001" ), ControlColor::Peterriver, num );
    }
    {
      uint16_t num = ESPUI.addControl( ControlType::Number, "Turn Output on if error is greater (BangOn)", String( steerConfig.steeringPidBangOn ), ControlColor::Peterriver, tab,
      []( Control * control, int id ) {
        steerConfig.steeringPidBangOn = control->value.toDouble();
      } );
      ESPUI.addControl( ControlType::Min, "Min", String( "0" ), ControlColor::Peterriver, num );
      ESPUI.addControl( ControlType::Max, "Max", String( "50" ), ControlColor::Peterriver, num );
      ESPUI.addControl( ControlType::Step, "Step", String( ".1" ), ControlColor::Peterriver, num );
    }
    {
      uint16_t num = ESPUI.addControl( ControlType::Number, "Turn Output off if error is smaller (BangOff)", String( steerConfig.steeringPidBangOff ), ControlColor::Peterriver, tab,
      []( Control * control, int id ) {
        steerConfig.steeringPidBangOff = control->value.toDouble();
      } );
      ESPUI.addControl( ControlType::Min, "Min", String( "0" ), ControlColor::Peterriver, num );
      ESPUI.addControl( ControlType::Max, "Max", String( "50" ), ControlColor::Peterriver, num );
      ESPUI.addControl( ControlType::Step, "Step", String( ".1" ), ControlColor::Peterriver, num );
    }

    {
      uint16_t num = ESPUI.addControl( ControlType::Number, "Distance from Line to turn Integral/Derivative of PID off", String( steerConfig.steeringPidDflTurnIdOff ), ControlColor::Peterriver, tab,
      []( Control * control, int id ) {
        steerConfig.steeringPidDflTurnIdOff = control->value.toInt();
      } );
      ESPUI.addControl( ControlType::Min, "Min", String( "0" ), ControlColor::Peterriver, num );
      ESPUI.addControl( ControlType::Max, "Max", String( "200" ), ControlColor::Peterriver, num );
      ESPUI.addControl( ControlType::Step, "Step", String( "1" ), ControlColor::Peterriver, num );
    }
  }

  // Wheel Angle Sensor Tab
  {
    uint16_t tab = ESPUI.addControl( ControlType::Tab, "Wheel Angle Sensor", "Wheel Angle Sensor" );

    {
      uint16_t sel = ESPUI.addControl( ControlType::Select, "Wheel Angle Sensor*", String( ( int )steerConfig.analogInWheelAngleSensor ), ControlColor::Wetasphalt, tab,
      []( Control * control, int id ) {
        steerConfig.analogInWheelAngleSensor = ( SteerConfig::AnalogIn )control->value.toInt();
        setResetButtonToRed();
      } );
      ESPUI.addControl( ControlType::Option, "None", "0", ControlColor::Alizarin, sel );
      addAnalogInputADS1115( sel );
      addAnalogInput( sel );
    }

    ESPUI.addControl( ControlType::Switcher, "Allow AgOpenGPS to overwrite Counts per Degree and Steer Angle Center", String( steerConfig.allowWheelAngleCenterAndCountsOverwrite ? "1" : "0" ), ControlColor::Peterriver, tab,
    []( Control * control, int id ) {
      steerConfig.allowWheelAngleCenterAndCountsOverwrite = control->value.toInt() == 1;
      Serial.println( ", test" );
    } );

    {
      uint16_t num = ESPUI.addControl( ControlType::Number, "Wheel Angle Sensor Center", String( steerConfig.steeringPositionZero ), ControlColor::Peterriver, tab,
      []( Control * control, int id ) {
        steerConfig.steeringPositionZero = control->value.toInt();
      } );
      ESPUI.addControl( ControlType::Min, "Min", String( "0" ), ControlColor::Peterriver, num );
      ESPUI.addControl( ControlType::Max, "Max", String( "26000" ), ControlColor::Peterriver, num );
      ESPUI.addControl( ControlType::Step, "Step", String( "1" ), ControlColor::Peterriver, num );
    }

    {
      uint16_t num = ESPUI.addControl( ControlType::Number, "Wheel Angle Counts per Degree", String( steerConfig.steerSensorCountsPerDegree ), ControlColor::Peterriver, tab,
      []( Control * control, int id ) {
        steerConfig.steerSensorCountsPerDegree = control->value.toFloat();
      } );
      ESPUI.addControl( ControlType::Min, "Min", String( "0" ), ControlColor::Peterriver, num );
      ESPUI.addControl( ControlType::Max, "Max", String( "250" ), ControlColor::Peterriver, num );
      ESPUI.addControl( ControlType::Step, "Step", String( "0.1" ), ControlColor::Peterriver, num );
    }

